## [ DataFrame 인덱스 다루기 ]

- (1) 모듈 로딩 <hr>

In [199]:
import pandas as pd

- (2) 데이터 준비 <hr>

In [200]:
exam = {'이름': ['혜인','민지','하니','해린'], 
        '국어' : [77, 88, 99, 100], 
        '미술' : [17, 18, 19, 10],
        '수학' : [27, 28, 29, 20], 
        '체육' : [37, 38, 39, 30]}

- (3) 데이터 저장

In [201]:
examDF = pd.DataFrame(exam)

- (4) 데이터 확인

In [202]:
examDF

   이름   국어  미술  수학  체육
0  혜인   77  17  27  37
1  민지   88  18  28  38
2  하니   99  19  29  39
3  해린  100  10  20  30

- (5) 새로운 인덱스 설정 - 방법1 : 인덱스 일부번경 DF.rename()

In [203]:
# 행 인덱스 일부 변경 => {기존인덱스:새로운인덱스}
# inplace 매개변수/파라미터 =>원본 DataFrame에 변경 여부 결정, 기본은 원본 변경 안함 False(기본값)!!
#examDF.rename(index = {0: 'zero'})        #기본값이 복사본 저장이라 원본은 바뀌지 않음
examDF.rename(index = {0: 'zero'}, inplace = True)

In [204]:
examDF

      이름   국어  미술  수학  체육
zero  혜인   77  17  27  37
1     민지   88  18  28  38
2     하니   99  19  29  39
3     해린  100  10  20  30

In [205]:
# 열 인덱스 일부 변경 => column = {기존인덱스:새로운인덱스}
examDF.rename(columns={'체육':'음악'}, inplace = True)

In [206]:
examDF.columns         #원본 컬럼명이 바뀐 것을 알수있다.

Index(['이름', '국어', '미술', '수학', '음악'], dtype='object')

- (5) 새로운 인덱스 설정 - 방법2 : 특정 컬럼 => 인덱스 : DF.set_index()

In [207]:
# 현재 기본 0 ~ ==> 이름 컬럼 인덱스로 설정
examDF.index

Index(['zero', 1, 2, 3], dtype='object')

In [208]:
#1개 컬럼을 인덱스로 설정 단, inplace 파라메터가 False로 원본 적용 안됨!
examDF.set_index('이름')

     국어  미술  수학  음악
이름
혜인   77  17  27  37
민지   88  18  28  38
하니   99  19  29  39
해린  100  10  20  30

In [209]:
examDF

      이름   국어  미술  수학  음악
zero  혜인   77  17  27  37
1     민지   88  18  28  38
2     하니   99  19  29  39
3     해린  100  10  20  30

In [210]:
# 2개의 컬럼을 행 인덱스 설정 단, inplace 파라메터가 False로 원본에 적용 안됨!
examDF2 = examDF.set_index(['이름','국어','음악'])       
examDF2.index
#2개가 묶여서 인덱스가 됨

MultiIndex([('혜인',  77, 37),
            ('민지',  88, 38),
            ('하니',  99, 39),
            ('해린', 100, 30)],
           names=['이름', '국어', '음악'])

In [211]:
examDF3 = examDF.set_index(['이름','국어','음악'])  
examDF3.index

MultiIndex([('혜인',  77, 37),
            ('민지',  88, 38),
            ('하니',  99, 39),
            ('해린', 100, 30)],
           names=['이름', '국어', '음악'])

In [212]:
examDF3.loc['혜인']        #인덱스 중 일부만 뽑아쓰면 나머지 인덱스와 함께 dataframe으로 나옴

       미술  수학
국어 음악
77 37  17  27

In [213]:
examDF3.loc[('혜인',77,37)] #지정된 인덱스를 뽑으면 행만 나옴 (시리즈형태)

미술    17
수학    27
Name: (혜인, 77, 37), dtype: int64

In [214]:
# KeyError => '혜인',77,37 형식으로 77로 시작하는 Key 없음
#examDF3.loc[(77, 37)]        #이거는 에러 발생. 왜냐하면 인덱스는 처음부터 서친한다고 해야하나 암튼 그래서 ㅇㅇ

- (5) 새로운 인덱스 설정 방법 3:

In [215]:
examDF.set_index('이름',inplace=True)

In [216]:
examDF

     국어  미술  수학  음악
이름
혜인   77  17  27  37
민지   88  18  28  38
하니   99  19  29  39
해린  100  10  20  30

In [217]:
# 현재 행 인덱스 ==> 컬럼으로 추가
examDF.reset_index()             #변경된 원본 인덱스를 원래대로 돌리고 싶음

   이름   국어  미술  수학  음악
0  혜인   77  17  27  37
1  민지   88  18  28  38
2  하니   99  19  29  39
3  해린  100  10  20  30

In [218]:
#examDF.reset_index().reset_index()      #이르케하면 새로운 인덱스가 설정되면 컬럼이 추가된다. 어짜피 데이터프레임에 메소드적용이니까

In [219]:
# 현재 행 인덱스를 컬럼에 추가하지 않고 삭제 => drop 파라미터를 True로 설정
df2 = examDF.reset_index(drop = True)
df2

    국어  미술  수학  음악
0   77  17  27  37
1   88  18  28  38
2   99  19  29  39
3  100  10  20  30